Repository: naolselemon/SmartE-Book
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: ReadLink
am: ሪድሊንክ

# settingsTitle
source: Settings
am: ቅንብሮች

source: Language
am: ቋንቋ

source: Theme
am: ገፅታ

# lightTheme
source: Light
am: ብርሃን

# darkTheme
source: Dark
am: ጨለማ

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Save Changes
am: ለውጦችን መዝግብ

source: Profile
am: መገለጫ

source: Sign Out
am: ውጣ

source: Update Profile
am: መገለጫ አዘምን

source: Name
am: ስም

source: Email
am: ኢሜይል

# newPassword
source: New Password (optional)
am: አዲስ የይለፍ ቃል (አማራጭ)

# confirmPassword
source: Confirm New Password
am: አዲስ የይለፍ ቃል አረጋግጥ

source: Name cannot be empty
am: ስም ባዶ መሆን አይችልም

# invalidEmail
source: Please enter a valid email
am: እባክዎ ትክክለኛ ኢሜይል ያስገቡ

source: Passwords do not match
am: የይለፍ ቃሎች አይዛመዱም

# passwordTooShort
source: Password must be at least 8 characters
am: የይለፍ ቃል ቢያንስ 8 ቁምፊዎች መሆን አለበት

# profileUpdated
source: Profile updated successfully!
am: መገለጫ በተሳካ ሁኔታ ተዘምኗል!

# permissionDenied
source: Permission denied. Please contact support.
am: ፍቃድ ተከልክሏል። እባክዎ ድጋፍን ያነጋግሩ።

# enterEmail
source: Please enter your email
am: እባክዎ ኢሜይልዎን ያስገቡ

# enterPassword
source: Please enter your password
am: እባክዎ የይለፍ ቃልዎን ያስገቡ

source: Sign-in successful!
am: መግባት ተሳክቷል!

source: Sign In
am: ግባ

source: Password
am: የይለፍ ቃል

source: Create New Account
am: አዲስ መለያ ፍጠር

source: Full Name
am: ሙሉ ስም

source: Sign Up
am: ይመዝገቡ

source: Sign-up successful!
am: መመዝገብ ተሳክቷል!

# errorPrefix
source: Error:
am: ስህተት፡

source: Get Started
am: ጀምር

source: I have an account
am: መለያ አለኝ

source: Description
am: መግለጫ

source: Reviews
am: ግምገማዎች

# byAuthorPrefix
source: by
am: በ

# reviewsSuffix
source: Reviews
am: ግምገማዎች

source: Summary
am: ማጠቃለያ

# audioAvailable
source: Audio Available By The Author
am: በደራሲው የቀረበ ኦዲዮ አለ

# noAudioAvailable
source: No Audio Available By The Author
am: በደራሲው የቀረበ ኦዲዮ የለም

source: Downloaded
am: የተጫነ

source: Download
am: አውርድ

# loginToFavorite
source: Please log in to favorite a book
am: መጽሐፍን ለመውደድ እባክዎ ይግቡ

# enableMediaPermissions
source: Please enable media permissions in app settings.
am: እባክዎ በመተግበሪያ ቅንብሮች ውስጥ የሚዲያ ፍቃዶችን ያንቁ።

# enableStoragePermissions
source: Please enable storage permissions in app settings.
am: እባክዎ በመተግበሪያ ቅንብሮች ውስጥ የማከማቻ ፍቃዶችን ያንቁ።

# enableFileAccess
source: Please enable file access in Settings.
am: እባክዎ በቅንብሮች ውስጥ የፋይል መዳረሻን ያንቁ።

source: Permissions denied
am: ፍቃዶች ተከልክለዋል

source: Downloading...
am: በመጫን ላይ...

source: Download completed
am: መጫን ተጠናቋል

# downloadFailedPrefix
source: Download failed:
am: መጫን አልተሳካም፡

source: Open Settings
am: ቅንብሮችን ክፈት

source: Home
am: መነሻ

source: Search
am: ፍለጋ

source: Library
am: ቤተ-መጽሐፍት

source: All Books
am: ሁሉም መጽሐፍት

# newBooks
source: New
am: አዲስ

source: Trending Books
am: ተወዳጅ መጽሐፍት

source: Your Favourites
am: የእርስዎ ተወዳጆች

# freeBooks
source: Free
am: ነፃ

# noTrendingBooks
source: No trending books available
am: ተወዳጅ መጽሐፍት የሉም

# noFavoriteBooks
source: No favorite books yet
am: እስካሁን ተወዳጅ መጽሐፍት የሉም

# noNewBooks
source: No new books available
am: አዲስ መጽሐፍት የሉም

# noFreeBooks
source: No free books available
am: ነፃ መጽሐፍት የሉም

source: No books available
am: መጽሐፍት የሉም

source: No downloaded books.
am: የተጫኑ መጽሐፍት የሉም

source: PDF not found
am: ፒዲኤፍ አልተገኘም

source: Audio not found
am: ኦዲዮ አልተገኘም

source: Unknown Title
am: ያልታወቀ ርዕስ

source: Unknown Author
am: ያልታወቀ ደራሲ

# loginToReview
source: Please log in to add a review
am: ግምገማ ለመጨመር እባክዎ ይግቡ

# provideRatingAndComment
source: Please provide a rating and comment
am: እባክዎ ደረጃ እና አስተያየት ያቅርቡ

source: Review added successfully
am: ግምገማ በተሳካ ሁኔታ ተጨምሯል

source: No reviews yet.
am: እስካሁን ግምገማዎች የሉም።

source: Add a Review
am: ግምገማ ጨምር

# commentLabel
source: Comment
am: አስተያየት

# searchHint
source: Search books by title, author, or genre
am: መጽሐፍትን በርዕስ፣ በደራሲ ወይም በዘውግ ፈልግ

source: Categories
am: ምድቦች

source: Famous Authors
am: ታዋቂ ደራሲዎች

# noBooksFound
source: No books found. Try a different search term.
am: መጽሐፍት አልተገኙም። የተለየ የፍለጋ ቃል ይሞክሩ።

# searchUnavailable
source: Search is currently unavailable. Please try again later.
am: ፍለጋ ለአሁን አይገኝም። እባክዎ ቆይተው እንደገና ይሞክሩ።
